{
  "name": "Lookerbot for Slack",
  "description": "A Slack bot for Looker, to make sharing data easier!",
  "repository": "https://github.com/looker/looker-slackbot",
  "keywords": ["looker", "bi", "analytics", "slack", "chat", "data"],
  "logo": "https://cdn.rawgit.com/looker/looker-slackbot/master/looker-bot-icon-512.png",
  "env": {
    "SLACK_API_KEY": {
      "description": "A Slack API token (find it on https://api.slack.com/web)",
      "required": true
    },
    "LOOKER_URL": {
      "description": "The web url of your Looker instance.",
      "required": true,
      "value": "https://mycompany.looker.com"
    },
    "LOOKER_API_BASE_URL": {
      "description": "The API 3.0 endpoint of your Looker instance.",
      "required": true,
      "value": "https://mycompany.looker.com:19999/api/3.0"
    },
    "LOOKER_API_3_CLIENT_ID": {
      "description": "The API 3.0 client ID for the user you want the bot to run as.",
      "required": true
    },
    "LOOKER_API_3_CLIENT_SECRET": {
      "description": "The API 3.0 client secret for the user you want the bot to run as.",
      "required": true
    },
    "LOOKER_CUSTOM_COMMAND_SPACE_ID": {
      "description": "The ID of a Space that you would like the bot to use to define custom commands.",
      "required": false
    },
    "SLACK_SLASH_COMMAND_TOKEN": {
      "description": "If you want to use slash commands with the Slack bot, provide the verification token from the slash command setup page so that the bot can verify the integrity of incoming slash commands.",
      "required": false
    },
    "SLACKBOT_S3_BUCKET": {
      "description": "If you want to use the Slack bot to post visualization images, provide an Amazon S3 bucket name.",
      "required": false
    },
    "SLACKBOT_S3_BUCKET_REGION": {
      "description": "If you want to use the Slack bot to post visualization images, provide an Amazon S3 bucket region.",
      "required": false,
      "value": "us-east-1"
    },
    "AWS_ACCESS_KEY_ID": {
      "description": "If you want to use the Slack bot to post visualization images, provide an Amazon S3 access key that can write to the provided bucket.",
      "required": false
    },
    "AWS_SECRET_ACCESS_KEY": {
      "description": "If you want to use the Slack bot to post visualization images, provide an Amazon S3 secret access key that can write to the provided bucket.",
      "required": false
    },
    "AZURE_STORAGE_ACCOUNT": {
      "description": "If you want to use Microsoft Azure Storage to store visualization images posted by the Slack bot, provide the name of your Azure Storage account.",
      "required": false
    },
    "SLACKBOT_AZURE_CONTAINER": {
      "description": "If you want to use Microsoft Azure Storage to store visualization images posted by the Slack bot, provide the name of the container within your Azure Storage account that you wish to use.",
      "required": false
    },
    "AZURE_STORAGE_ACCESS_KEY": {
      "description": "If using Microsoft Azure Storage to store visualization images posted by the Slack bot, provide an access key that can write to the provided Azure Storage account and container.",
      "required": false
    }
  }
}
